/*
 * функція контролю показників середовища відповідно до (кліматичних карт) обраного режиму інкубації (обраної породи (
 * параметри задаються автоматично для основних порід птахів  
 * або вручну якщо таких птахів немає в списку)
 * в функції перевіряються і виводяться для моніторингу параметри інкубації
 * 
 */
#include <main.h>
void parameter_control ()   {   
  Serial.print(myText[13]);// виводимо в серіал режим утримання
 if((incubator_1.routing>0)&&(incubator_1.routing<=8)) // якщо до цього часу обрано режим інкубації не ручний
  {// переглядаємо умови і їх записуємо у відповідні змінні для контролю
    switch (incubator_1.routing){//  кого інкубуємо
     //якщо це бройлери перевіряємо параметри     
     case 1: //  режим інкубації бройлера на основі даних по кросу COBB500
   
     Serial.print(myText[20]);// виводимо режим утримання - бройлер
    if(incubator_1.dey<=2)   // якщо днів інкубаці менше 2-х (тобто перший і другий день інкубації   {Tmax=35;        // встановлюємо темп.максимальну в приміщенні
    {Setpoint=38.1;         // встановлюємо яку температуру в інкубаторі треба тримати
    Hmax=52;// встановлюємо максимум вологості, яку треба тримати
    Hmin=48; // встановлюємо мінімум вологості , яку треба тримати
    twmax = 25; // максимальна температура в баці з водою для підвищення вологості 
    twmin = 19; // максимальна температура в баці з водою для підвищення вологості 
    gazmax =550; // норми 350-600 для людей оптимальна
   // переворот - 1 раз в 90 хвилин
    Serial.print(myText[40]); Serial.print(Input);Serial.println(myText[19]);
    Serial.print(myText[41]); Serial.print(Setpoint);Serial.println(myText[19]);
    Serial.print(myText[46]); Serial.print(incubator_1.tegg);Serial.println(myText[19]);
    Serial.print(myText[15]); Serial.print(incubator_1.h);Serial.println(myText[14]);
    Serial.print(myText[49]); Serial.print(incubator_1.CO2);Serial.println(myText[48]);
    
   }
   
   else if
   ((incubator_1.dey>=3)&&(incubator_1.dey<=12))// між 3 і 12 днем
   {  Setpoint=37.6;         // встановлюємо яку температуру в інкубаторі треба тримати
    Hmax=53;// встановлюємо максимум вологості, яку треба тримати
    Hmin=48; // встановлюємо мінімум вологості , яку треба тримати
    twmax = 25; // максимальна температура в баці з водою для підвищення вологості 
    twmin = 19; // максимальна температура в баці з водою для підвищення вологості 
    gazmax =500; // норми 350-600 для людей оптимальна
   // переворот - 1 раз в 90 хвилин
    }
  else if 
     ((incubator_1.dey>=13)&&(incubator_1.dey<=18))// між 13 і 18 днем
    { Setpoint=37.5;         // встановлюємо яку температуру в інкубаторі треба тримати
    Hmax=57;// встановлюємо максимум вологості, яку треба тримати
    Hmin=53; // встановлюємо мінімум вологості , яку треба тримати
    twmax = 25; // максимальна температура в баці з водою для підвищення вологості 
    twmin = 19; // максимальна температура в баці з водою для підвищення вологості 
    gazmax =500; // норми 350-600 для людей оптимальна
   // переворот - 1 раз в 90 хвилин
    }
         else if
    (incubator_1.dey==19)
    { Setpoint=37.2;         // встановлюємо яку температуру в інкубаторі треба тримати
    Hmax=73;// встановлюємо максимум вологості, яку треба тримати
    Hmin=68; // встановлюємо мінімум вологості , яку треба тримати
    twmax = 25; // максимальна температура в баці з водою для підвищення вологості 
    twmin = 19; // максимальна температура в баці з водою для підвищення вологості 
    gazmax =500; // норми 350-600 для людей оптимальна
   // переворот - повністю припиняємо, переходимо у вивідну фазу
    }
    else if
    (incubator_1.dey>19)
   {  Setpoint=36.8;         // встановлюємо яку температуру в інкубаторі треба тримати
    Hmax=82;// встановлюємо максимум вологості, яку треба тримати
    Hmin=77; // встановлюємо мінімум вологості , яку треба тримати
    twmax = 25; // максимальна температура в баці з водою для підвищення вологості 
    twmin = 19; // максимальна температура в баці з водою для підвищення вологості 
    gazmax =500; // норми 350-600 для людей оптимальна
   // переворот - повністю припиняємо, переходимо у вивідну фазу
    }
   break;
 case 2:// параметри утримання індиків
    Serial.print(myText[21]);// виводимо режим утримання - бройлер
    if(incubator_1.dey<=2)   // якщо днів інкубаці менше 2-х (тобто перший і другий день інкубації   {Tmax=35;        // встановлюємо темп.максимальну в приміщенні
   { Setpoint=38.1;         // встановлюємо яку температуру в інкубаторі треба тримати
    Hmax=52;// встановлюємо максимум вологості, яку треба тримати
    Hmin=48; // встановлюємо мінімум вологості , яку треба тримати
    twmax = 25; // максимальна температура в баці з водою для підвищення вологості 
    twmin = 19; // максимальна температура в баці з водою для підвищення вологості 
    gazmax =550; // норми 350-600 для людей оптимальна
   // переворот - 1 раз в 90 хвилин
   }
   
   else  if
   ((incubator_1.dey>=3)&&(incubator_1.dey==12))// між 3 і 12 днем
    { Setpoint=37.6;         // встановлюємо яку температуру в інкубаторі треба тримати
    Hmax=53;// встановлюємо максимум вологості, яку треба тримати
    Hmin=48; // встановлюємо мінімум вологості , яку треба тримати
    twmax = 25; // максимальна температура в баці з водою для підвищення вологості 
    twmin = 19; // максимальна температура в баці з водою для підвищення вологості 
    gazmax =500; // норми 350-600 для людей оптимальна
   // переворот - 1 раз в 90 хвилин
    }
  else if 
     ((incubator_1.dey>=13)&&(incubator_1.dey<=18))// між 13 і 18 днем
    { Setpoint=37.5;         // встановлюємо яку температуру в інкубаторі треба тримати
    Hmax=57;// встановлюємо максимум вологості, яку треба тримати
    Hmin=53; // встановлюємо мінімум вологості , яку треба тримати
    twmax = 25; // максимальна температура в баці з водою для підвищення вологості 
    twmin = 19; // максимальна температура в баці з водою для підвищення вологості 
    gazmax =500; // норми 350-600 для людей оптимальна
   // переворот - 1 раз в 90 хвилин
    }
  else if
    (incubator_1.dey==19)
   {  Setpoint=37.2;         // встановлюємо яку температуру в інкубаторі треба тримати
    Hmax=73;// встановлюємо максимум вологості, яку треба тримати
    Hmin=68; // встановлюємо мінімум вологості , яку треба тримати
    twmax = 25; // максимальна температура в баці з водою для підвищення вологості 
    twmin = 19; // максимальна температура в баці з водою для підвищення вологості 
    gazmax =500; // норми 350-600 для людей оптимальна
   // переворот - повністю припиняємо, переходимо у вивідну фазу
    }
    else if
    (incubator_1.dey>19)
    { Setpoint=36.8;         // встановлюємо яку температуру в інкубаторі треба тримати
    Hmax=82;// встановлюємо максимум вологості, яку треба тримати
    Hmin=77; // встановлюємо мінімум вологості , яку треба тримати
    twmax = 25; // максимальна температура в баці з водою для підвищення вологості 
    twmin = 19; // максимальна температура в баці з водою для підвищення вологості 
    gazmax =500; // норми 350-600 для людей оптимальна
   // переворот - повністю припиняємо, переходимо у вивідну фазу
    }
   break;
 case 3://качки
 Serial.print(myText[22]);// виводимо режим утримання - качки
 if(incubator_1.dey<=7)   // якщо днів інкубаці менше 2-х (тобто перший і другий день інкубації   {Tmax=35;        // встановлюємо темп.максимальну в приміщенні
   { Setpoint=38.1;         // встановлюємо яку температуру в інкубаторі треба тримати
    Hmax=72;// встановлюємо максимум вологості, яку треба тримати
    Hmin=68; // встановлюємо мінімум вологості , яку треба тримати
    twmax = 25; // максимальна температура в баці з водою для підвищення вологості 
    twmin = 19; // максимальна температура в баці з водою для підвищення вологості 
    gazmax =550; // норми 350-600 для людей оптимальна
   timer_interval_incubator=180UL * 60UL * 1000UL;// переворот - 1 раз в 3 години
   }
   
   else  if
   ((incubator_1.dey>=8)&&(incubator_1.dey<=14))// між 3 і 12 днем
    { Setpoint=37.8;         // встановлюємо яку температуру в інкубаторі треба тримати
    Hmax=62;// встановлюємо максимум вологості, яку треба тримати
    Hmin=58; // встановлюємо мінімум вологості , яку треба тримати
    twmax = 25; // максимальна температура в баці з водою для підвищення вологості 
    twmin = 19; // максимальна температура в баці з водою для підвищення вологості 
    gazmax =500; // норми 350-600 для людей оптимальна
   timer_interval_incubator=120UL * 60UL * 1000UL;// переворот - 1 раз в 2 години
    }
  else if 
     ((incubator_1.dey>=15)&&(incubator_1.dey<=25))// між 13 і 18 днем
    { Setpoint=37.8;         // встановлюємо яку температуру в інкубаторі треба тримати
    Hmax=62;// встановлюємо максимум вологості, яку треба тримати
    Hmin=58; // встановлюємо мінімум вологості , яку треба тримати
    twmax = 25; // максимальна температура в баці з водою для підвищення вологості 
    twmin = 19; // максимальна температура в баці з водою для підвищення вологості 
    gazmax =500; // норми 350-600 для людей оптимальна
   timer_interval_incubator=120UL * 60UL * 1000UL;// переворот - 1 раз в 2 години
    }
         else if
     ((incubator_1.dey>=26)&&(incubator_1.dey<=28))// між 13 і 18 днем
   { Setpoint=37.5;         // встановлюємо яку температуру в інкубаторі треба тримати
    Hmax=91;// встановлюємо максимум вологості, яку треба тримати
    Hmin=84; // встановлюємо мінімум вологості , яку треба тримати
    twmax = 25; // максимальна температура в баці з водою для підвищення вологості 
    twmin = 19; // максимальна температура в баці з водою для підвищення вологості 
    gazmax =500; // норми 350-600 для людей оптимальна
    timer_interval_incubator=0; //- повністю припиняємо, переходимо у вивідну фазу
    }
   
   break;
  case 4:// параметри утримання перепілки
  Serial.print(myText[23]);// виводимо режим утримання - бройлер
   if(incubator_1.dey<=2)   // якщо днів інкубаці менше 2-х (тобто перший і другий день інкубації   {Tmax=35;        // встановлюємо темп.максимальну в приміщенні
   { Setpoint=38.1;         // встановлюємо яку температуру в інкубаторі треба тримати
    Hmax=52;// встановлюємо максимум вологості, яку треба тримати
    Hmin=48; // встановлюємо мінімум вологості , яку треба тримати
    twmax = 25; // максимальна температура в баці з водою для підвищення вологості 
    twmin = 19; // максимальна температура в баці з водою для підвищення вологості 
    gazmax =550; // норми 350-600 для людей оптимальна
   // переворот - 1 раз в 90 хвилин
   }
   
   else  if
   ((incubator_1.dey>=3)&&(incubator_1.dey<=12))// між 3 і 12 днем
    { Setpoint=37.6;         // встановлюємо яку температуру в інкубаторі треба тримати
    Hmax=53;// встановлюємо максимум вологості, яку треба тримати
    Hmin=48; // встановлюємо мінімум вологості , яку треба тримати
    twmax = 25; // максимальна температура в баці з водою для підвищення вологості 
    twmin = 19; // максимальна температура в баці з водою для підвищення вологості 
    gazmax =500; // норми 350-600 для людей оптимальна
   // переворот - 1 раз в 90 хвилин
    }
  else if 
     ((incubator_1.dey>=13)&&(incubator_1.dey<=18))// між 13 і 18 днем
     {Setpoint=37.5;         // встановлюємо яку температуру в інкубаторі треба тримати
    Hmax=57;// встановлюємо максимум вологості, яку треба тримати
    Hmin=53; // встановлюємо мінімум вологості , яку треба тримати
    twmax = 25; // максимальна температура в баці з водою для підвищення вологості 
    twmin = 19; // максимальна температура в баці з водою для підвищення вологості 
    gazmax =500; // норми 350-600 для людей оптимальна
   // переворот - 1 раз в 90 хвилин
    }
         else if
    (incubator_1.dey==19)
    { Setpoint=37.2;         // встановлюємо яку температуру в інкубаторі треба тримати
    Hmax=73;// встановлюємо максимум вологості, яку треба тримати
    Hmin=68; // встановлюємо мінімум вологості , яку треба тримати
    twmax = 25; // максимальна температура в баці з водою для підвищення вологості 
    twmin = 19; // максимальна температура в баці з водою для підвищення вологості 
    gazmax =500; // норми 350-600 для людей оптимальна
   // переворот - повністю припиняємо, переходимо у вивідну фазу
    }
    else if
    (incubator_1.dey>19)
    { Setpoint=36.8;         // встановлюємо яку температуру в інкубаторі треба тримати
    Hmax=82;// встановлюємо максимум вологості, яку треба тримати
    Hmin=77; // встановлюємо мінімум вологості , яку треба тримати
    twmax = 25; // максимальна температура в баці з водою для підвищення вологості 
    twmin = 19; // максимальна температура в баці з водою для підвищення вологості 
    gazmax =500; // норми 350-600 для людей оптимальна
   // переворот - повністю припиняємо, переходимо у вивідну фазу
    }
   break;
 
  case 5:
 Serial.print(myText[24]);// "Pheasan ",                   
  if(incubator_1.dey<=2)   // якщо днів інкубаці менше 2-х (тобто перший і другий день інкубації   {Tmax=35;        // встановлюємо темп.максимальну в приміщенні
   { Setpoint=38.1;         // встановлюємо яку температуру в інкубаторі треба тримати
    Hmax=52;// встановлюємо максимум вологості, яку треба тримати
    Hmin=48; // встановлюємо мінімум вологості , яку треба тримати
    twmax = 25; // максимальна температура в баці з водою для підвищення вологості 
    twmin = 19; // максимальна температура в баці з водою для підвищення вологості 
    gazmax =550; // норми 350-600 для людей оптимальна
   // переворот - 1 раз в 90 хвилин
   }
   
   else  if
   ((incubator_1.dey>=3)&&(incubator_1.dey<=12))// між 3 і 12 днем
    { Setpoint=37.6;         // встановлюємо яку температуру в інкубаторі треба тримати
    Hmax=53;// встановлюємо максимум вологості, яку треба тримати
    Hmin=48; // встановлюємо мінімум вологості , яку треба тримати
    twmax = 25; // максимальна температура в баці з водою для підвищення вологості 
    twmin = 19; // максимальна температура в баці з водою для підвищення вологості 
    gazmax =500; // норми 350-600 для людей оптимальна
   // переворот - 1 раз в 90 хвилин
    }
  else if 
     ((incubator_1.dey>=13)&&(incubator_1.dey<=18))// між 13 і 18 днем
    { Setpoint=37.5;         // встановлюємо яку температуру в інкубаторі треба тримати
    Hmax=57;// встановлюємо максимум вологості, яку треба тримати
    Hmin=53; // встановлюємо мінімум вологості , яку треба тримати
    twmax = 25; // максимальна температура в баці з водою для підвищення вологості 
    twmin = 19; // максимальна температура в баці з водою для підвищення вологості 
    gazmax =500; // норми 350-600 для людей оптимальна
   // переворот - 1 раз в 90 хвилин
    }
         else if
    (incubator_1.dey==9)
    { Setpoint=37.2;         // встановлюємо яку температуру в інкубаторі треба тримати
    Hmax=73;// встановлюємо максимум вологості, яку треба тримати
    Hmin=68; // встановлюємо мінімум вологості , яку треба тримати
    twmax = 25; // максимальна температура в баці з водою для підвищення вологості 
    twmin = 19; // максимальна температура в баці з водою для підвищення вологості 
    gazmax =500; // норми 350-600 для людей оптимальна
   // переворот - повністю припиняємо, переходимо у вивідну фазу
    }
    else if
    (incubator_1.dey>19)
   {  Setpoint=36.8;         // встановлюємо яку температуру в інкубаторі треба тримати
    Hmax=82;// встановлюємо максимум вологості, яку треба тримати
    Hmin=77; // встановлюємо мінімум вологості , яку треба тримати
    twmax = 25; // максимальна температура в баці з водою для підвищення вологості 
    twmin = 19; // максимальна температура в баці з водою для підвищення вологості 
    gazmax =500; // норми 350-600 для людей оптимальна
   // переворот - повністю припиняємо, переходимо у вивідну фазу
    }
   break;
  case 6:
  Serial.print(myText[25]);// "Numida  ",                   
  if(incubator_1.dey<=2)   // якщо днів інкубаці менше 2-х (тобто перший і другий день інкубації   {Tmax=35;        // встановлюємо темп.максимальну в приміщенні
   { Setpoint=38.1;         // встановлюємо яку температуру в інкубаторі треба тримати
    Hmax=52;// встановлюємо максимум вологості, яку треба тримати
    Hmin=48; // встановлюємо мінімум вологості , яку треба тримати
    twmax = 25; // максимальна температура в баці з водою для підвищення вологості 
    twmin = 19; // максимальна температура в баці з водою для підвищення вологості 
    gazmax =550; // норми 350-600 для людей оптимальна
   // переворот - 1 раз в 90 хвилин
   }
   
   else  if
   ((incubator_1.dey>=3)&&(incubator_1.dey==12))// між 3 і 12 днем
    { Setpoint=37.6;         // встановлюємо яку температуру в інкубаторі треба тримати
    Hmax=53;// встановлюємо максимум вологості, яку треба тримати
    Hmin=48; // встановлюємо мінімум вологості , яку треба тримати
    twmax = 25; // максимальна температура в баці з водою для підвищення вологості 
    twmin = 19; // максимальна температура в баці з водою для підвищення вологості 
    gazmax =500; // норми 350-600 для людей оптимальна
   // переворот - 1 раз в 90 хвилин
    }
  else if 
     ((incubator_1.dey>=13)&&(incubator_1.dey<=18))// між 13 і 18 днем
    { Setpoint=37.5;         // встановлюємо яку температуру в інкубаторі треба тримати
    Hmax=57;// встановлюємо максимум вологості, яку треба тримати
    Hmin=53; // встановлюємо мінімум вологості , яку треба тримати
    twmax = 25; // максимальна температура в баці з водою для підвищення вологості 
    twmin = 19; // максимальна температура в баці з водою для підвищення вологості 
    gazmax =500; // норми 350-600 для людей оптимальна
   // переворот - 1 раз в 90 хвилин
    }
         else if
    (incubator_1.dey==19)
    { Setpoint=37.2;         // встановлюємо яку температуру в інкубаторі треба тримати
    Hmax=73;// встановлюємо максимум вологості, яку треба тримати
    Hmin=68; // встановлюємо мінімум вологості , яку треба тримати
    twmax = 25; // максимальна температура в баці з водою для підвищення вологості 
    twmin = 19; // максимальна температура в баці з водою для підвищення вологості 
    gazmax =500; // норми 350-600 для людей оптимальна
   // переворот - повністю припиняємо, переходимо у вивідну фазу
    }
    else if
    (incubator_1.dey>19)
   { Setpoint=36.8;         // встановлюємо яку температуру в інкубаторі треба тримати
    Hmax=82;// встановлюємо максимум вологості, яку треба тримати
    Hmin=77; // встановлюємо мінімум вологості , яку треба тримати
    twmax = 25; // максимальна температура в баці з водою для підвищення вологості 
    twmin = 19; // максимальна температура в баці з водою для підвищення вологості 
    gazmax =500; // норми 350-600 для людей оптимальна
   // переворот - повністю припиняємо, переходимо у вивідну фазу
    }
   break;
   // гуси
    case 7:
  Serial.print(myText[26]);// виводимо режим інкубації- гусей "Anser   ",
  if(incubator_1.dey<=7)   // якщо днів інкубаці менше 2-х (тобто перший і другий день інкубації   {Tmax=35;        // встановлюємо темп.максимальну в приміщенні
   { Setpoint=37.8;         // встановлюємо яку температуру в інкубаторі треба тримати
    Hmax=69;// встановлюємо максимум вологості, яку треба тримати
    Hmin=66; // встановлюємо мінімум вологості , яку треба тримати
    twmax = 25; // максимальна температура в баці з водою для підвищення вологості 
    twmin = 19; // максимальна температура в баці з водою для підвищення вологості 
    gazmax =550; // норми 350-600 для людей оптимальна
   timer_interval_incubator=120UL * 60UL * 1000UL;// переворот - 1 раз в 2 години
   }
   
   else  if
   ((incubator_1.dey>=8)&&(incubator_1.dey<=14))// між 3 і 12 днем
   {  Setpoint=37.6;         // встановлюємо яку температуру в інкубаторі треба тримати
    Hmax=55;// встановлюємо максимум вологості, яку треба тримати
    Hmin=53; // встановлюємо мінімум вологості , яку треба тримати
    twmax = 25; // максимальна температура в баці з водою для підвищення вологості 
    twmin = 19; // максимальна температура в баці з водою для підвищення вологості 
    gazmax =500; // норми 350-600 для людей оптимальна
   timer_interval_incubator=120UL * 60UL * 1000UL;// переворот - 1 раз в 2 години
    }
  else if 
     ((incubator_1.dey>=15)&&(incubator_1.dey<=27))// між 13 і 18 днем
   {  Setpoint=37.5;         // встановлюємо яку температуру в інкубаторі треба тримати
    Hmax=57;// встановлюємо максимум вологості, яку треба тримати
    Hmin=53; // встановлюємо мінімум вологості , яку треба тримати
    twmax = 25; // максимальна температура в баці з водою для підвищення вологості 
    twmin = 19; // максимальна температура в баці з водою для підвищення вологості 
    gazmax =500; // норми 350-600 для людей оптимальна
   timer_interval_incubator=120UL * 60UL * 1000UL;// переворот - 1 раз в 2 години
    }
         else if
    ((incubator_1.dey>=28)&&(incubator_1.dey<=29))
    { Setpoint=37.2;         // встановлюємо яку температуру в інкубаторі треба тримати
    Hmax=73;// встановлюємо максимум вологості, яку треба тримати
    Hmin=70; // встановлюємо мінімум вологості , яку треба тримати
    twmax = 25; // максимальна температура в баці з водою для підвищення вологості 
    twmin = 19; // максимальна температура в баці з водою для підвищення вологості 
    gazmax =500; // норми 350-600 для людей оптимальна
   timer_interval_incubator=0;// переворот - 1 раз в 2 години
    }
   
   break;
case 8:
  Serial.print(myText[27]);// виводимо режим утримання - "Strays  ",                  
  if(incubator_1.dey<=2)   // якщо днів інкубаці менше 2-х (тобто перший і другий день інкубації 
   { Setpoint=38.1;         // встановлюємо яку температуру в інкубаторі треба тримати
    Hmax=52;// встановлюємо максимум вологості, яку треба тримати
    Hmin=48; // встановлюємо мінімум вологості , яку треба тримати
    twmax = 25; // максимальна температура в баці з водою для підвищення вологості 
    twmin = 19; // максимальна температура в баці з водою для підвищення вологості 
    gazmax =550; // норми 350-600 для людей оптимальна
   // переворот - 1 раз в 90 хвилин
   }
   
   else  if
   ((incubator_1.dey>=3)&&(incubator_1.dey<=12))// між 3 і 12 днем
    { Setpoint=37.6;         // встановлюємо яку температуру в інкубаторі треба тримати
    Hmax=53;// встановлюємо максимум вологості, яку треба тримати
    Hmin=48; // встановлюємо мінімум вологості , яку треба тримати
    twmax = 25; // максимальна температура в баці з водою для підвищення вологості 
    twmin = 19; // максимальна температура в баці з водою для підвищення вологості 
    gazmax =500; // норми 350-600 для людей оптимальна
   // переворот - 1 раз в 90 хвилин
    }
  else if 
     (18>=incubator_1.dey>=13)//&&(incubator_1.dey1<=18) // між 13 і 18 днем
    { Setpoint=37.5;         // встановлюємо яку температуру в інкубаторі треба тримати
    Hmax=57;// встановлюємо максимум вологості, яку треба тримати
    Hmin=53; // встановлюємо мінімум вологості , яку треба тримати
    twmax = 25; // максимальна температура в баці з водою для підвищення вологості 
    twmin = 19; // максимальна температура в баці з водою для підвищення вологості 
    gazmax =500; // норми 350-600 для людей оптимальна
   // переворот - 1 раз в 90 хвилин
    }
         else if
    (incubator_1.dey=19)
   {  Setpoint=37.2;         // встановлюємо яку температуру в інкубаторі треба тримати
    Hmax=73;// встановлюємо максимум вологості, яку треба тримати
    Hmin=68; // встановлюємо мінімум вологості , яку треба тримати
    twmax = 25; // максимальна температура в баці з водою для підвищення вологості 
    twmin = 19; // максимальна температура в баці з водою для підвищення вологості 
    gazmax =500; // норми 350-600 для людей оптимальна
   // переворот - повністю припиняємо, переходимо у вивідну фазу
    }
    else if
    (incubator_1.dey>19)
    { Setpoint=36.8;         // встановлюємо яку температуру в інкубаторі треба тримати
    Hmax=82;// встановлюємо максимум вологості, яку треба тримати
    Hmin=77; // встановлюємо мінімум вологості , яку треба тримати
    twmax = 25; // максимальна температура в баці з водою для підвищення вологості 
    twmin = 19; // максимальна температура в баці з водою для підвищення вологості 
    gazmax =500; // норми 350-600 для людей оптимальна
   // переворот - повністю припиняємо, переходимо у вивідну фазу
    }
   break;

  }
  // коли встановлено ручний режим виставлення параметрів
if (incubator_1.routing==9)
 {  Serial.println(myText[28]);
    Setpoint= EEPROM.get(15,Setpoint);    // читаємо з пам'яті параметр температури, яку треба утримувати
    
  gazmax =EEPROM.get(18,gazmax);    // читаємо з пам'яті параметр СО2;
   
    Hmax=EEPROM.get(20,Hmax);    // читаємо з пам'яті параметр максимуму вологості;
   
    Hmin=EEPROM.get(22,Hmin);    // читаємо з пам'яті параметр мінімуму вологості;
    
    twmax = EEPROM.get(24,twmax);    // читаємо з пам'яті параметр максимуму температури в баці для охолодження
     twmin = EEPROM.get(26,twmin); // читаємо з пам'яті параметр мінімуму температури в баці для охолодження
   }

Serial.print(myText[40]); Serial.print(Input);Serial.println(myText[19]);
    Serial.print(myText[41]); Serial.print(Setpoint);Serial.println(myText[19]);
    Serial.print(myText[46]); Serial.print(incubator_1.tegg);Serial.println(myText[19]);
    Serial.print(myText[15]); Serial.print(incubator_1.h);Serial.println(myText[14]);
    Serial.print(myText[49]); Serial.print(incubator_1.CO2);Serial.println(myText[48]);
    Serial.print(myText[31]); Serial.print(incubator_1.tw);Serial.println(myText[19]);
//Serial.println();


   
 }
}